#作业
'''
13-晓振-Py201706062-第五次作业
'''
#题目一 练习上课讲的内容 


#题目二
Q2 = '''
利用今天所学知识写出99乘法口诀表
'''
print(Q2)
print("******************************九九乘法口诀************************")
for i in range(1,10):
    for j in range(1,10):
        if i <= j:
            print('%s x %s = %2d'%(i,j,i*j),end = ' ')
    print()
print("********************************END*****************************")


#题目三
Q3 = '''
有两个列表x 和 y，要求：y中的元素如果在x中也有的话，就把该元素从x中移除，不能利用集合的方法
在全部移除之后打印：“移除结束”，和x y
'''
print(Q3)
x = [1,2,3,4,'a','b','c']
y = [2,4,5,'b','d','e']
print('移除前列表\n',x,'\n',y,'\n') 
for i in x:
    for j in y:
        if i == j:
            x.remove(i)
print('移除结束\n',x,'\n',y,'\n')    
